#include "MyComponent.hpp"

/*-------------------------------------------------*/
/*コンポーネントの初期化を行う関数                    */
/*リソースの確保がこの関数の主な役割です               */
/*-------------------------------------------------*/
void MyComponent::construct()
{

}

/*-------------------------------------------------*/
/*コンポーネントの終了処理を行う関数                  */
/*リソースの解放などがこの関数の役割です              */
/*-------------------------------------------------*/
void MyComponent::destruct()
{
	
}

/*-------------------------------------------------*/
/*コンポーネントが最初の更新を行う際                  */
/*一度だけ呼ばれる関数                               */
/*-------------------------------------------------*/
void MyComponent::start()
{

}

/*-------------------------------------------------*/
/*毎フレーム呼ばれる更新関数                         */
/*setEnableUpdate関数でfalseを指定すると無効になります*/
/*-------------------------------------------------*/
void MyComponent::update()
{

}

/*-------------------------------------------------*/
/*毎フレーム呼ばれる描画関数                         */
/*この関数を使用する際はsetEnableDraw関数にtrueを渡す */
/*だけでなく, DrawableComponentを継承してください     */
/*-------------------------------------------------*/
void MyComponent::draw() const
{

}

/*-------------------------------------------------*/
/*コンポーネントが有効になった際に呼ばれる関数         */
/*-------------------------------------------------*/
void MyComponent::onActive()
{

}

/*-------------------------------------------------*/
/*コンポーネントが無効になった際に呼ばれる関数         */
/*-------------------------------------------------*/
void MyComponent::onInactive()
{

}

/*-------------------------------------------------*/
/*コンポーネントが衝突した時に呼ばれる関数             */
/*-------------------------------------------------*/
void MyComponent::onCollisionEnter([[maybe_unused]] const Libra::Collision& _collision)
{

}

/*-------------------------------------------------*/
/*コンポーネントが衝突している間呼ばれる関数           */
/*-------------------------------------------------*/
void MyComponent::onCollisionStay([[maybe_unused]] const Libra::Collision& _collision)
{

}

/*-------------------------------------------------*/
/*コンポーネントの衝突が終わった時に呼ばれる関数        */
/*-------------------------------------------------*/
void MyComponent::onCollisionExit([[maybe_unused]] const Libra::Collision& _collision)
{

}
